package dto.data;

public final class StringsData {


    //MAIN
    public String getGovCorp() {
        return "ГОСУДАРСТВЕННАЯ КОРПОРАЦИЯ";
    }

    public String getAgency() {
        return "АГЕНСТВО";
    }

    public String getInsur() {
        return "ПО СТРАХОВАНИЮ ВКЛАДОВ";
    }

    public String getManager() {
        return " КОНКУРСНЫЙ УПРАВЛЯЮЩИЙ ";
    }

    public String getLfo() {
        return "ООО «НСГ – «РОСЭНЕРГО»";
    }

    public String getAsvAddress() {
        return "127994, г. Москва, ГСП-4";
    }

    public String getPhnNmb() {
        return "тел. +7 (495) 725-31-29";
    }

    public String getDateAndNmb() {
        return "от____________№____________";
    }

    public String getDebtor() {
        return "Должник:";
    }

    public String getOgrn() {
        return "(ОГРН: 1020400754285,";
    }

    public String getInn() {
        return "ИНН: 0411063374, КПП: 041101001)";
    }

    public String getLfoAddress1() {
        return "649000, Республика Алтай, г. Горно-Алтайск,";
    }

    public String getLfoAddress2() {
        return "Коммунистический пр-т, д. 9, оф. 1";
    }

    public String getInFace1() {
        return "в лице конкурсного управляющего";
    }

    public String getInFace2() {
        return "государственной корпорации «Агентство по";
    }

    public String getInFace3() {
        return "страхованию вкладов»";
    }

    public String getMailAddress() {
        return "Адрес для направления корреспонденции:";
    }

    public String getIpNumberTxt() {
        return "Номер ИП:";
    }

    public String getPetition() {
        return "ХОДАТАЙСТВО";
    }

    public String getDecisionInfo() {
        return "Решением Арбитражного суда Республики Алтай по делу № А02-211/2021 (резолютивная часть которого объявлена 21.07.2021) ООО «НСГ – «РОСЭНЕРГО» " +
                "признано несостоятельным (банкротом), в отношении него открыто конкурсное производство, полномочия конкурсного управляющего возложены на " +
                "государственную корпорацию «Агентство по страхованию вкладов».";
    }

    public String getResultInfo() {
        return "Исходя из вышеизложенного,";
    }

    public String getAsking() {
        return "ПРОШУ:";
    }

    public String getAttachment() {
        return "Приложения.";
    }

    public String getDecisionAttach() {
        return "Копия решения АС Республики Алтай от 21.07.2021 (резолютивная часть) по делу № А02-211/2021.";
    }

    public String getWarrantAttach() {
        return "Копия доверенности на представителя.";
    }

    public String getFirstActAttach() {
        return "Копия определения АС Республики Алтай от 18.02.2021 по делу № А02-211/2021.";
    }

    public String getDiplomaAttach() {
        return "Копия диплома на представителя.";
    }


    //SIGN
    public String getSignData1() {
        return "Начальник пятого отдела";
    }

    public String getSignData2() {
        return "правового сопровождения судебной работы";
    }

    public String getSignData3() {
        return "департамента правового сопровождения                            " +
                "                            Д.А. Поздняков";
    }


    //FSSP
    public String getPettAbout() {
        return "об окончании исполнительного производства";
    }

    public String getFsspLawInfo() {
        return "Согласно п.п. 7 п. 1 ст.47 Федерального закона от 02.10.2007 № 229-ФЗ " +
                "«Об исполнительном производстве», исполнительное производство оканчивается судебным приставом-исполнителем " +
                "в случае признания должника банкротом и направления исполнительного документа арбитражному управляющему.";

    }


    //COURT

    public String courtNameTitle() {
        return "об оставлении иска без рассмотрения";
    }

    public String courtPar3() {
        return "Согласно п.п. 4 п. 1 ст. 148 АПК РФ, арбитражный суд оставляет исковое заявление без рассмотрения, если после его принятия к производству установит, что заявлено требование, которое в соответствии с федеральным законом должно быть рассмотрено в деле о банкротстве.";
    }

    public String courtPar4() {
        return "Согласно п. 33 «Обзора судебной практики Верховного Суда Российской Федерации № 3 (2016)» утв. Президиумом Верховного Суда РФ 19.10.2016, оставление искового заявления без рассмотрения является обязательным, за исключением случаев когда согласно законодательству о банкротстве соответствующее требование может быть рассмотрено вне рамок дела о банкротстве.";
    }

    public String courtPar5() {
        return "ООО «НСГ – «РОСЭНЕРГО» является страховой организацией.";
    }

    public String courtPar6() {
        return "Согласно п. 4 ст. 184.5. Федерального закона от 26.10.2002 № 127-ФЗ «О несостоятельности (банкротстве)» (далее – Закон о банкротстве), требования страхователя, застрахованного лица или выгодоприобретателя по договорам страхования включаются в реестр требований кредиторов независимо от даты возникновения обязательства.";
    }

    public String courtPar7() {
        return "Таким образом исковые требования, вытекающие из договоров страхования в любом случае подлежат оставлению без рассмотрения.";
    }

    public String courtPar8() {
        return "Требование вытекающие из иных оснований подлежат дальнейшему рассмотрению только в случае если они относятся к текущим платежам (ст. 134 Закона о банкротстве), т.е. если основание возникновения задолженности возникло после принятия судом к производству заявления о признании ООО «НСГ – «РОСЭНЕРГО» несостоятельным (18.02.2021 и позднее).";
    }

    public String courtSecondAsk() {
        return "2.\tПроцессуальные документы направить в адрес конкурсного управляющего ООО «НСГ – «РОСЭНЕРГО» по адресу: 127994, г. Москва, ГСП-4.";
    }


    //COURT TRANSFER

    public String sendToAnotherCourt() {
        return "о передаче дела в арбитражный суд";
    }

    public String transferPart3() {
        return "Согласно п. 1 ст. 126 Федерального закона от 26.10.2002 № 127-ФЗ «О несостоятельности (банкротстве)» (далее – Закон о банкротстве), с даты принятия арбитражным судом решения о признании должника банкротом и об открытии конкурсного производства все требования кредиторов по денежным обязательствам, об уплате обязательных платежей, иные имущественные требования, за исключением текущих платежей, указанных в п. 1 ст. 134 Закона о банкротстве, и требований о признании права собственности, об истребовании имущества из чужого незаконного владения, о признании недействительными ничтожных сделок и о применении последствий их недействительности могут быть предъявлены только в ходе конкурсного производства.";
    }

    public String transferPart4() {
        return "Согласно п. 4 ст. 184.5. Закона о банкротстве, требования страхователя, застрахованного лица или выгодоприобретателя по договорам страхования (в том числе в случае, о возврате страховой премии) включаются в реестр требований кредиторов в порядке очередности, предусмотренном статьей 184.10 Закона о банкротстве, независимо от даты возникновения обязательства.";
    }

    public String transferPart5() {
        return "В силу п. 3 ст. 22 ГПК РФ суды рассматривают и разрешают дела, предусмотренные пунктами первым и вторым указанной статьи, за исключением экономических споров и других дел, отнесенных федеральным конституционным законом и федеральным законом к компетенции арбитражных судов.";

    }

    public String transferPart6() {
        return "Согласно п. 2.1 ст. 33 ГПК РФ, если при рассмотрении дела в суде выявилось, что оно подлежит рассмотрению арбитражным судом, суд передает дело в арбитражный суд, к подсудности которого оно отнесено.";
    }

    public String transferPart7() {
        return "Согласно абз. 2 п. 2 Постановления Пленума Верховного Суда РФ от 09.07.2019 № 26 \"О некоторых вопросах применения Гражданского процессуального кодекса Российской Федерации, Арбитражного процессуального кодекса Российской Федерации, Кодекса административного судопроизводства Российской Федерации в связи с введением в действие Федерального закона от 28 ноября 2018 года N 451-ФЗ \"О внесении изменений в отдельные законодательные акты Российской Федерации\", правила п. 2.1 ст. 33 ГПК РФ действуют, в том числе в отношении исков поданных до вступления в силу Федерального закона N 451-ФЗ, т.е. не зависимо от даты возникновения соответствующего обстоятельства.";
    }


    public String transferSecondAsk() {
        return "2.\tВ случае наличия в деле иных Ответчиков – рассмотреть вопрос выделении исковых требований в отношении ООО «НСГ – «РОСЭНЕРГО в отдельное производство с последующей передачей дела в Арбитражный суд Республики Алтай.";
    }

    public String transferThirdAsk() {
        return "3.\tПроцессуальные документы направить в адрес конкурсного управляющего ООО «НСГ – «РОСЭНЕРГО» по адресу: 127994, г. Москва, ГСП-4.";
    }

    //CHANGE INFO\

    public String changeInfoAbout() {
        return "об изменении реквизитов лица участвующего в деле";
    }

    public String changeLawAPK() {
        return "Согласно п. 2 ст. 124 АПК РФ, лица, участвующие в деле, обязаны сообщить арбитражному суду об изменении своего адреса во время производства по делу.";
    }

    public String changeLawGPK() {
        return "Согласно ст. 118 ГПК РФ, лица, участвующие в деле, обязаны сообщить суду о перемене своего адреса во время производства по делу.";
    }

    public String changeFirstAsk() {
        return "1.\tУказывать в процессуальных и исполнительных документах Истца в виде : ООО «НСГ – «РОСЭНЕРГО» в лице конкурсного управляющего государственной корпорации «Агентство по страхованию вкладов».";
    }

    public String changeSecondAsk() {
        return "2.\tПроцессуальные документы направить в адрес конкурсного управляющего ООО «НСГ – «РОСЭНЕРГО» по адресу: 127994, г. Москва, ГСП-4.";
    }


    //ДЛЯ ЖАЛОБ ПО РЕГРЕССАМ И СУБРОГАЦИЯМ

    public String par2() {
        return "Согласно п. 2 ст. 129 ФЗ «О несостоятельности (банкротстве)» конкурсный управляющий обязан предъявлять к третьим лицам, имеющим задолженность перед должником, требования о ее взыскании в порядке, установленном ФЗ «О несостоятельности (банкротстве)».";
    }


    public String par5() {
        return "Согласно п. 4 ст. 14 Федерального закона от 25.04.2002 № 40-ФЗ (в ред. от 23.06.2016) «Об обязательном страховании гражданской ответственности владельцев транспортных средств» (далее – Закон об ОСАГО) страховщик, который застраховал гражданскую ответственность потерпевшего, осуществляет возмещение вреда, причиненного имуществу потерпевшего, от имени страховщика, который застраховал гражданскую ответственность лица, причинившего вред (осуществляет прямое возмещение убытков).";
    }


    public String par7() {
        return "В соответствии с п. 5 ст.14.1 Закона об ОСАГО Страховщик, который застраховал гражданскую ответственность лица, причинившего вред, обязан возместить в счет страхового возмещения по договору обязательного страхования страховщику, осуществившему прямое возмещение убытков.";
    }


    public String par9() {
        return "В соответствии с п. 1 ст. 14 Федерального закона от 25.04.2002 № 40-ФЗ «Об обязательном страховании гражданской ответственности владельцев транспортных средств»: к страховщику, выплатившему страховое возмещение, переходит право требования потерпевшего к лицу, причинившему вред, в размере произведенной потерпевшему страховой выплаты, если ";
    }


    public String reasons1() {
        return "указанное лицо не включено в договор обязательного страхования в качестве лица, допущенного к управлению транспортным средством.";
    }

    public String reasons2() {
        return "вред был причинен указанным лицом при управлении транспортным средством в состоянии опьянения (алкогольного, наркотического или иного) либо указанное лицо не выполнило требование уполномоченного должностного лица о прохождении медицинского освидетельствования на состояние опьянения или оно не выполнило требование Правил дорожного движения Российской Федерации о запрещении водителю употреблять алкогольные напитки, наркотические или психотропные вещества после дорожно-транспортного происшествия, к которому он причастен.";
    }

    public String reasons3() {
        return "указанное лицо не имело права на управление транспортным средством, при использовании которого им был причинен вред.";
    }

    public String reasons4() {
        return "указанное лицо скрылось с места дорожно-транспортного происшествия.";
    }

    public String reasons5() {
        return "страховой случай наступил при использовании указанным лицом транспортного средства в период, не предусмотренный договором обязательного страхования (при заключении договора обязательного страхования с условием использования транспортного средства в период, предусмотренный договором обязательного страхования).";
    }

    public String consequence1() {
        return "Поскольку Вы не были включены в договор ОСАГО в качестве лица, допущенного к управлению транспортным средством в соответствии со ст. 14 Закона об ОСАГО ООО «НСГ – «РОСЭНЕРГО» предъявляет требование к Вам, как к лицу, причинившему вред в размере произведенной страховщиком страховой выплаты.";
    }

    public String consequence2() {
        return "Поскольку Вы скрылись с места дорожно-транспортного происшествия на основании ст. 14 Закона об ОСАГО ООО «НСГ – «РОСЭНЕРГО» предъявляет требование к причинившему вред лицу в размере произведенной страховщиком страховой выплаты.";
    }

    public String consequence3() {
        return "Поскольку Вы не имели права на управление транспортным средством, при использовании которого был причинен вред в соответствии со ст. 14 Закона об ОСАГО ООО «НСГ – «РОСЭНЕРГО» предъявляет требование к причинившему вред лицу в размере произведенной страховщиком страховой выплаты.";
    }

    public String consequence4() {
        return "Поскольку Вами был причинен вред при управлении транспортным средством в состоянии опьянения в соответствии со ст. 14 Закона об ОСАГО ООО «НСГ – «РОСЭНЕРГО» предъявляет требование к Вам, как к лицу, причинившему вред в размере произведенной страховщиком страховой выплаты.";
    }




    public String payDataPar1() {
        return "В связи с вышеизложенным, просим незамедлительно погасить задолженность.";
    }

    public String payDataPar2() {
        return "Реквизиты для погашения задолженности:";
    }

    public String payDataPar3() {
        return "Получатель: Государственная корпорация «Агентство по страхованию вкладов»";
    }

    public String payDataPar4() {
        return "Адрес: Россия, г. Москва, 109240, ул. Высоцкого, д. 4";
    }

    public String payDataPar5() {
        return "Банк получателя ГУ Банка России по ЦФО, г Москва 3";
    }

    public String payDataPar6() {
        return "БИК 044525000";
    }

    public String payDataPar7() {
        return "Расчетный счет 40503810345250007051";
    }

    public String payDataPar8() {
        return "ИНН 7708514824";
    }

    public String payDataPar9() {
        return "КПП 770901001";
    }

    public String payDataPar10() {
        return "В назначении платежа ОБЯЗАТЕЛЬНО указать:";
    }

    public String payDataPar11() {
        return "«счёт ООО «НСГ – «РОСЭНЕРГО» № 76/16-039, ФИО (наименование) должника, номер и дата договора»";
    }


    public String subPar2() {
        return "Вы являлись участником дорожно-транспортного происшествия (далее - ДТП), в результате которого транспортному средству лица, застрахованного в ООО «НСГ – «РОСЭНЕРГО», были причинены механические повреждения.";
    }


    public String subPar6() {
        return "Поскольку на момент ДТП Ваша гражданская ответственность не была застрахована ООО «НСГ – «РОСЭНЕРГО» предъявляет требование к Вам, как к лицу, ответственному за убытки в размере произведенной страховщиком страховой выплаты.\n" +
                "В соответствии с п. 1 ст. 965 ГК РФ к страховщику, выплатившему страховое возмещение, переходит в пределах выплаченной суммы право требования, которое страхователь имеет к лицу, ответственному за убытки, возмещенные в результате страхования. Перешедшее к страховщику право требования осуществляется им с соблюдением правил, регулирующих отношения между страхователем и лицом, ответственным за убытки (п. 2 ст. 965 ГК РФ).\n";
    }


    public String sunParLast() {
        return "В случае полного или частичного отказа в удовлетворении претензии в указанный срок Страховая организация будет вынуждена обратиться с иском в суд в установленном порядке.";
    }



    //Кредитор




}