package dto;

public final class StringsData {


    //MAIN
    public String getGovCorp() {
        return "  ГОСУДАРСТВЕННАЯ КОРПОРАЦИЯ  ";
    }

    public String getAgency() {
        return " АГЕНСТВО ";
    }

    public String getInsur() {
        return " ПО СТРАХОВАНИЮ ВКЛАДОВ ";
    }

    public String getManager() {
        return " КОНКУРСНЫЙ УПРАВЛЯЮЩИЙ ";
    }

    public String getLfo() {
        return "ООО «НСГ – «РОСЭНЕРГО»";
    }

    public String getAsvAddress() {
        return "127994, г. Москва, ГСП-4";
    }

    public String getPhnNmb() {
        return "тел. +7 (495) 725-31-29";
    }

    public String getDateAndNmb() {
        return "от____________№____________";
    }

    public String getDebtor() {
        return "Должник:";
    }

    public String getOgrn() {
        return "(ОГРН: 1020400754285,";
    }

    public String getInn() {
        return "ИНН: 0411063374, КПП: 041101001)";
    }

    public String getLfoAddress1() {
        return "649000, Республика Алтай, г. Горно-Алтайск,";
    }

    public String getLfoAddress2() {
        return "Коммунистический пр-т, д. 9, оф. 1";
    }

    public String getInFace1() {
        return "в лице конкурсного управляющего";
    }

    public String getInFace2() {
        return "государственной корпорации «Агентство по";
    }

    public String getInFace3() {
        return "страхованию вкладов»";
    }

    public String getMailAddress() {
        return "Адрес для направления корреспонденции:";
    }

    public String getIpNumberTxt() {
        return "Номер ИП:";
    }

    public String getPetition() {
        return "ХОДАТАЙСТВО";
    }

    public String getDecisionInfo() {
        return "Решением Арбитражного суда Республики Алтай от ХХ.ХХ.2021 по делу № А02-211/2021 (резолютивная часть которого объявлена ХХ.ХХ.2021) ООО «НСГ – «РОСЭНЕРГО» " +
                "признано несостоятельным (банкротом), в отношении него открыто конкурсное производство, полномочия конкурсного управляющего возложены на " +
                "государственную корпорацию «Агентство по страхованию вкладов».";
    }

    public String getResultInfo() {
        return "Исходя из вышеизложенного,";
    }

    public String getAsking() {
        return "ПРОШУ:";
    }

    public String getAttachment() {
        return "Приложения.";
    }

    public String getDecisionAttach() {
        return "Копия решения АС Республики Алтай от ХХ.ХХ.2021 по делу № А02-211/2021.";
    }

    public String getWarrantAttach() {
        return "Копия доверенности представителя.";
    }

    public String getFirstActAttach() {
        return "Копия определения АС Республики Алтай от 18.02.2021 по делу № А02-211/2021";
    }

    public String getDiplomaAttach() {
        return "Копия диплома представителя.";
    }




    //SIGN
    public String getSignData1() {
        return "Главный юрисконсульт";
    }

    public String getSignData2() {
        return "Первого отдела ПССР ДПС                                     " +
                "                                            И.А. Богданов";
    }





    //FSSP
    public String getPettAbout() {
        return "об окончании исполнительного производства";
    }

    public String getFsspLawInfo() {
        return "Согласно п.п. 7 п. 1 ст.47 Федерального закона от 02.10.2007 № 229-ФЗ " +
                "«Об исполнительном производстве», исполнительное производство оканчивается судебным приставом-исполнителем " +
                "в случае признания должника банкротом и направления исполнительного документа арбитражному управляющему.";

    }


    //COURT

    public String courtNameTitle() {
        return "об оставлении иска без рассмотрения";
    }

    public String courtPar3() {
        return "Согласно п.п. 4 п. 1 ст. 148 АПК РФ, арбитражный суд оставляет исковое заявление без рассмотрения, если после его принятия к производству установит, что заявлено требование, которое в соответствии с федеральным законом должно быть рассмотрено в деле о банкротстве.";
    }

    public String courtPar4() {
        return "Согласно п. 33 «Обзора судебной практики Верховного Суда Российской Федерации № 3 (2016)» утв. Президиумом Верховного Суда РФ 19.10.2016, оставление искового заявления без рассмотрения является обязательным, за исключением случаев когда согласно законодательству о банкротстве соответствующее требование может быть рассмотрено вне рамок дела о банкротстве.";
    }

    public String courtPar5() {
        return "ООО «НСГ – «РОСЭНЕРГО» является страховой организацией.";
    }

    public String courtPar6() {
        return "Согласно п. 4 ст. 184.5. Федерального закона от 26.10.2002 № 127-ФЗ «О несостоятельности (банкротстве)» (далее – Закон о банкротстве), требования страхователя, застрахованного лица или выгодоприобретателя по договорам страхования включаются в реестр требований кредиторов независимо от даты возникновения обязательства.";
    }

    public String courtPar7() {
        return "Таким образом исковые требования, вытекающие из договоров страхования в любом случае подлежат оставлению без рассмотрения.";
    }

    public String courtPar8() {
        return "Требование вытекающие из иных оснований подлежат дальнейшему рассмотрению только в случае если они относятся к текущим платежам (ст. 134 Закона о банкротстве), т.е. если основание возникновения задолженности возникло после принятия судом к производству заявления о признании ООО «НСГ – «РОСЭНЕРГО» несостоятельным (18.02.2021 и позднее).";
    }

    public String courtSecondAsk() {
        return "2.\tПроцессуальные документы направить в адрес конкурсного управляющего ООО «НСГ – «РОСЭНЕРГО» по адресу: 127994, г. Москва, ГСП-4.";
    }


}